#pragma once


//							"1.2"					// 国际标准化组织成员标识
//							"1.2.156"				// 中国
//							"1.2.156.197"			// 国家密码管理局
#define szOID_OSCCA			"1.2.156.10197"			// 国家密码标准技术委员会
#define szOID_SM			"1.2.156.10197.1"		// 密码算法
//	分组密码算法对象标识符
//							"1.2.156.10197.1.100"	// 分组密码算法
#define szOID_SM_SM6		"1.2.156.10197.1.101"	// SM6分组密码算法
#define szOID_SM_SM1		"1.2.156.10197.1.102"	// SM1分组密码算法
#define szOID_SM_SSF33		"1.2.156.10197.1.103"	// SSF33密码算法
#define szOID_SM_SM4		"1.2.156.10197.1.104"	// SM4分组密码算法
#define szOID_SM_SM7		"1.2.156.10197.1.105"	// SM7分组密码算法
#define szOID_SM_SM8		"1.2.156.10197.1.106"	// SM8分组密码算法
//	序列密码算法对象标识符
//							"1.2.156.10197.1.200"	// 序列密码算法
#define szOID_SM_SM5		"1.2.156.10197.1.201"	// SM5序列密码算法
//	公钥密码算法对象标识符
//	"1.2.156.10197.1.300"	// 公钥密码算法
#define szOID_SM_SM2		"1.2.156.10197.1.301"	// SM2椭圆曲线密码算法
// 							"1.2.156.10197.1.301.1"	// SM2-1椭圆曲线数字签名算法
// 							"1.2.156.10197.1.301.2"	// SM2-2椭圆曲线密钥交换协议
// 							"1.2.156.10197.1.301.3"	// SM2-3椭圆曲线加密算法
#define szOID_SM_SM9		"1.2.156.10197.1.302"	// SM9标识密码算法
// 							"1.2.156.10197.1.302.1"	// SM9-1数字签名算法
// 							"1.2.156.10197.1.302.2"	// SM9-2密钥交换协议
// 							"1.2.156.10197.1.302.3"	// SM9-3密钥封装机制和公钥加密算法
//	杂凑算法对象标识符
//	"1.2.156.10197.1.400	杂凑算法
#define szOID_SM_SM3		"1.2.156.10197.1.401"	// SM3密码杂凑算法
// 							"1.2.156.10197.1.401.1"	// SM3密码杂凑算法，无密钥使用
// 							"1.2.156.10197.1.401.2"	// SM3密码杂凑算法，有密钥使用
//	组合运算算法对象标识符
// 							"1.2.156.10197.1.500"	// 组合运算机制
#define szOID_SM_SM3SM2		"1.2.156.10197.1.501"	// 基于SM2算法和SM3算法的签名
#define szOID_SM_SHA1SM2	"1.2.156.10197.1.502"	// 基于SM2算法和SHA_1算法的签名
#define szOID_SM_SHA256SM2	"1.2.156.10197.1.503"	// 基于SM2算法和SHA_256算法的签名
#define szOID_SM_SM3RSA		"1.2.156.10197.1.504"	// 基于RSA算法和SM3算法的签名
//	CA代码对象标识符
// 							"1.2.156.10197.4.3"		// CA代码
//	标准体系对象标识符
// 							"1.2.156.10197.6"		// 标准体系
// 							"1.2.156.10197.6.1"		// 基础类
// 							"1.2.156.10197.6.1.1"	// 算法类
// 							"1.2.156.10197.6.1.2"	// 标识类
// 							"1.2.156.10197.6.1.3"	// 工作模式
// 							"1.2.156.10197.6.1.4"	// 安全机制
// 							"1.2.156.10197.6.1.4.1"	// SM2密码使用规范
// 							"1.2.156.10197.6.1.4.2"	// SM2加密签名消息语法规范
// 							"1.2.156.10197.6.2"		// 设备类
// 							"1.2.156.10197.6.3"		// 服务类
// 							"1.2.156.10197.6.4"		// 基础设施
// 							"1.2.156.10197.6.5"		// 检测类
// 							"1.2.156.10197.6.6"		// 管理类
